#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


Terraform will perform the following actions:

  # module.KEYCLOAK_TEST.module.moh_applications.module.DHIPER.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "DHIPER"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "Digital Health Initiatives Progress, Evaluation, and Results (DHIPER) Portal"
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "DHIPER"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "http://localhost:*",
          + "https://devdhiper.hlth.gov.bc.ca/*",
          + "https://localhost:*",
          + "https://sitdhiper.hlth.gov.bc.ca/*",
          + "https://uatdhiper.hlth.gov.bc.ca/*",
        ]
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.DHIPER.keycloak_openid_user_attribute_protocol_mapper.idir_displayName will be created
  + resource "keycloak_openid_user_attribute_protocol_mapper" "idir_displayName" {
      + add_to_access_token  = true
      + add_to_id_token      = true
      + add_to_userinfo      = true
      + aggregate_attributes = false
      + claim_name           = "idir_displayName"
      + claim_value_type     = "String"
      + client_id            = (known after apply)
      + id                   = (known after apply)
      + multivalued          = false
      + name                 = "idir_displayName"
      + realm_id             = "moh_applications"
      + user_attribute       = "idir_displayName"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.DHIPER.keycloak_openid_user_client_role_protocol_mapper.client_role_mapper will be created
  + resource "keycloak_openid_user_client_role_protocol_mapper" "client_role_mapper" {
      + add_to_access_token         = true
      + add_to_id_token             = true
      + add_to_userinfo             = true
      + claim_name                  = "roles"
      + claim_value_type            = "String"
      + client_id                   = (known after apply)
      + client_id_for_role_mappings = "DHIPER"
      + id                          = (known after apply)
      + multivalued                 = true
      + name                        = "client roles"
      + realm_id                    = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.DHIPER.module.client-roles.keycloak_role.ROLES["DHIPER_ALL"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "DHIPER_ALL"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.DHIPER.module.client-roles.keycloak_role.ROLES["DHIPER_ReportProgram_All"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "DHIPER_ReportProgram_All"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.DHIPER.module.client-roles.keycloak_role.ROLES["DHIPER_ReportSection_All"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "DHIPER_ReportSection_All"
      + realm_id  = "moh_applications"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*